pipeFlowAnalysis/pimpleFoamPipe/LES/Smagorinsky/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType	LES;

LES
{
	LESModel	Smagorinsky;

	turbulence	on;

	printCoeffs	on;

	// can add more constants here
	delta		cubeRootVol;
	SmagorinskyCoeffs
	{
		Ck		0.094;
		Ce		1.048;
	}
}


// ************************************************************************* //
